---
kind: other
id: Methods.T:Autodesk.Revit.DB.SpotDimensionType
source: html/2c71edb1-3caf-6417-3ad0-90667ceef0f5.htm
---
# SpotDimensionType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.